In [2]:
import pandas as pd

In [3]:
# Series
sample_pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90])
print(sample_pandas_data)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [4]:
# index をアルファベットでつける
sample_pandas_index_data = pd.Series(
[0,10,20,30,40,50,60,70,80,90],
index = ['a','b','c','d','e','f','g','h','i','j'])
print(sample_pandas_index_data)

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [5]:
print(sample_pandas_data)
print(sample_pandas_index_data)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64
a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [ ]:
# 2-4-3 DataFrameの使い方

In [7]:
attri_data1 = {
'ID':['100','101','102','103','104'],
'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
'Birth_year':[1990,1989,1992,1997,1982],
'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}

attri_data_frame1 = pd.DataFrame(attri_data1)

print(attri_data_frame1)

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [8]:
print(attri_data1)

{'ID': ['100', '101', '102', '103', '104'], 'City': ['Tokyo', 'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'], 'Birth_year': [1990, 1989, 1992, 1997, 1982], 'Name': ['Hiroshi', 'Akiko', 'Yuki', 'Satoru', 'Steve']}

In [10]:
attri_data_frame_index1 = pd.DataFrame(attri_data1, index=['a','b','c','d','e'])
print(attri_data_frame_index1)

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

In [11]:
attri_data_frame_index1

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

In [12]:
# 転置
attri_data_frame1.T

                  0      1      2         3      4
ID              100    101    102       103    104
City          Tokyo  Osaka  Kyoto  Hokkaido  Tokyo
Birth_year     1990   1989   1992      1997   1982
Name        Hiroshi  Akiko   Yuki    Satoru  Steve

In [13]:
# 特定の列を取り出す
attri_data_frame1.Birth_year

0    1990
1    1989
2    1992
3    1997
4    1982
Name: Birth_year, dtype: int64

In [18]:
attri_data_frame1[['ID', 'Birth_year']]

    ID  Birth_year
0  100        1990
1  101        1989
2  102        1992
3  103        1997
4  104        1982

In [19]:
# 2-4-5 データの抽出

In [20]:
# 条件（フィルター)
attri_data_frame1[attri_data_frame1['City'] == 'Tokyo']

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
4  104  Tokyo        1982    Steve

In [21]:
attri_data_frame1['City'] == 'Tokyo'

0     True
1    False
2    False
3    False
4     True
Name: City, dtype: bool

In [24]:
attri_data_frame1[attri_data_frame1['City'].isin(['Tokyo', 'Osaka'])]

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
1  101  Osaka        1989    Akiko
4  104  Tokyo        1982    Steve

In [25]:
attri_data_frame1[attri_data_frame1['Birth_year']>1982]

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru

In [31]:
# データの削除と結合

In [34]:
# データの削除
attri_data_frame1.drop(['Birth_year'], axis = 1)

    ID      City     Name
0  100     Tokyo  Hiroshi
1  101     Osaka    Akiko
2  102     Kyoto     Yuki
3  103  Hokkaido   Satoru
4  104     Tokyo    Steve

In [35]:
attri_data_frame1

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [38]:
# データの結合
# 別データの準備
attri_data2 = {
'ID':['100','101','102','105','107'],
'Math':[50, 43, 33, 76, 98],
'English':[90,30,20,50,30],
'Sex':['M','F','F','M','M']}
attri_data_frame2 = pd.DataFrame(attri_data2)
attri_data_frame2

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [39]:
# データのマージ
pd.merge(attri_data_frame1, attri_data_frame2)

    ID   City  Birth_year     Name  Math  English Sex
0  100  Tokyo        1990  Hiroshi    50       90   M
1  101  Osaka        1989    Akiko    43       30   F
2  102  Kyoto        1992     Yuki    33       20   F

In [40]:
# 集計
# データのグループ集計
attri_data_frame2.groupby('Sex')['Math'].mean()

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64

In [43]:
attri_data_frame2.groupby('Sex')['English'].mean()

Sex
F    25.000000
M    56.666667
Name: English, dtype: float64

In [45]:
# 値のソート
attri_data2 = {'ID':['100','101','102','103','104'],
    		   'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}
attri_data_frame2 = pd.DataFrame(attri_data2)
attri_data_frame_index2 = pd.DataFrame(attri_data2, index=['e','b','a','d', 'c'])
attri_data_frame_index2

    ID      City  Birth_year     Name
e  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
a  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
c  104     Tokyo        1982    Steve

In [46]:
# indexによるソート
attri_data_frame_index2.sort_index()

    ID      City  Birth_year     Name
a  102     Kyoto        1992     Yuki
b  101     Osaka        1989    Akiko
c  104     Tokyo        1982    Steve
d  103  Hokkaido        1997   Satoru
e  100     Tokyo        1990  Hiroshi

In [47]:
# 値によるソート、デフォルトは昇順
attri_data_frame_index2.Birth_year.sort_values()

c    1982
b    1989
e    1990
a    1992
d    1997
Name: Birth_year, dtype: int64

In [48]:
# 値があるかどうかの確認
attri_data_frame_index2.isin(['Tokyo'])

      ID   City  Birth_year   Name
e  False   True       False  False
b  False  False       False  False
a  False  False       False  False
d  False  False       False  False
c  False   True       False  False

In [50]:
import numpy as np
# 欠損値の取り扱い
# nameを全てnanにする

attri_data_frame_index2['Name'] = np.nan
attri_data_frame_index2.isnull()

      ID   City  Birth_year  Name
e  False  False       False  True
b  False  False       False  True
a  False  False       False  True
d  False  False       False  True
c  False  False       False  True

In [51]:
# nullを判定し、合計する
attri_data_frame_index2.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64

In [52]:
# 練習2-7
# 以下のライブラリを使うので、あらかじめ読み込んでおいてください
import numpy as np
import numpy.random as random
import scipy as sp
import pandas as pd
from pandas import Series, DataFrame

# 可視化ライブラリ
import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns
%matplotlib inline

# 小数第３位まで表示
%precision 3

'%.3f'

In [53]:
# 2-7
attri_data1 = {
        'ID':['1','2','3','4','5']
        ,'Sex':['F','F','M','M','F']
        ,'Money':[1000,2000,500,300,700]
        ,'Name':['Saito','Horie','Kondo','Kawada','Matsubara']
}

attri_data_frame1 = DataFrame(attri_data1)

In [54]:
attri_data_frame1[attri_data_frame1['Money']>=500]

  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
2  3   M    500      Kondo
4  5   F    700  Matsubara

In [59]:
# 2-8
attri_data_frame1.groupby('Sex')['Money'].mean()

Sex
F    1233.333333
M     400.000000
Name: Money, dtype: float64

In [60]:
# 2-9
attri_data2 = {
        'ID':['3','4','7']
        ,'Math':[60,30,40]
        ,'English':[80,20,30]
}

attri_data_frame2 = DataFrame(attri_data2)

In [61]:
# データのマージ
pd.merge(attri_data_frame1, attri_data_frame2)

  ID Sex  Money    Name  Math  English
0  3   M    500   Kondo    60       80
1  4   M    300  Kawada    30       20

In [62]:
merge_data = attri_data_frame1.merge(attri_data_frame2)

In [63]:
merge_data.mean()

ID          17.0
Money      400.0
Math        45.0
English     50.0
dtype: float64

In [64]:
# 解答
merge_data = attri_data_frame1.merge(attri_data_frame2)
merge_data.mean()

ID          17.0
Money      400.0
Math        45.0
English     50.0
dtype: float64